## VENDOR  "Altera"
## PROGRAM "Quartus Prime"
## VERSION "Version 20.1.0 Build 711 06/05/2020 SJ Lite Edition"

## DATE    "Sun Sep 27 16:31:58 2020"

##
## DEVICE  "10CL006YE144C6G"
##


#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3


create_clock -period 20.000 -name osc_clk
set_input_delay -clock osc_clock 0.1 [all_inputs]
set_output_delay -clock osc_clock 0.1 [all_outputs]
derive_pll_clocks
derive_clock_uncertainty